cases/decay/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//libs            (overset fvMotionSolvers);

application     interFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         500;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   5.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   13;

runTimeModifiable yes;

adjustTimeStep  yes;//no;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       0.05;

functions
{
 forces
    {
        type            forces;
        libs            (forces);
        patches         (float);
        rhoInf          1025.0;
        log             on;
        writeControl    writeTime;
        CofR            (0.0 0.0 -9.893);
    }
    
    sixDoFRigidBodyState
    {
        type           sixDoFRigidBodyState;
        libs           (sixDoFRigidBodyState);
        angleFormat    degrees;
        writeControl    writeTime;
    }

}


// ************************************************************************* //
